app/views/autos/_form.html.erb

    <%= f.label :agent %><br />
   	<%= f.collection_select(:agent_id, Agent.order('nome'), :id, :nome, {:prompt => true})%>
---
SELECT "agents".* FROM "agents" ORDER BY nome