app/views/autos/index.html.erb

SELECT "autos".* FROM "autos" WHERE (data_do_cadastro LIKE '%{"(3i)"=>"3", "(2i)"=>"1", "(1i)"=>"2012"}%')
---
<center><h4>Controle de AIT's realizado no dia
<% if @autos == Auto.all %>