app/views/autos/report.html.erb

SELECT "autos".* FROM "autos" WHERE (data_do_cadastro LIKE '%2012-01-04%') ORDER BY agent_id
---
<center><h4>Controle de AIT realizado no dia
<% if @autos == Auto.all %>