app/controllers/agents_controller.rb

SELECT "agents".* FROM "agents" ORDER BY nome LIMIT 50 OFFSET 0
---
  def index
    @agents = Agent.order("nome").paginate :page => params['page'], :per_page => 50

SELECT "agents".* FROM "agents" WHERE "agents"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @agent = Agent.find(params[:id])

SELECT "agents".* FROM "agents" WHERE "agents"."id" = ? LIMIT 1  [["id", "1"]]
---
  def edit
    @agent = Agent.find(params[:id])

INSERT INTO "agents" ("created_at", "mat", "nome", "turno", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Mon, 02 Jan 2012 19:07:47 UTC +00:00], ["mat", "10726"], ["nome", "Joarez Muniz Gonçalves Filhos"], ["turno", "Tarde"], ["updated_at", Mon, 02 Jan 2012 19:07:47 UTC +00:00]]
---
  def create
    @agent = Agent.new(params[:agent])

    respond_to do |format|
      if @agent.save

SELECT "agents".* FROM "agents" WHERE "agents"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "agents" SET "mat" = '434-2/10726', "updated_at" = '2012-01-02 19:09:19.971530' WHERE "agents"."id" = 1
---
  def update
    @agent = Agent.find(params[:id])

    respond_to do |format|
      if @agent.update_attributes(params[:agent])

SELECT "agents".* FROM "agents" WHERE "agents"."id" = ? LIMIT 1  [["id", "1"]]
---
  def destroy
    @agent = Agent.find(params[:id])