app/controllers/autos_controller.rb

  def index
    @autos = Auto.search(params[:search], params[:page])
---
SELECT "autos".* FROM "autos" WHERE (data_do_cadastro LIKE '%{"(3i)"=>"3", "(2i)"=>"1", "(1i)"=>"2012"}%')
SELECT COUNT(*) FROM "autos" WHERE (data_do_cadastro like '%%')

  def show
    @auto = Auto.find(params[:id])
---
SELECT "autos".* FROM "autos" WHERE "autos"."id" = ? LIMIT 1  [["id", "1"]]

  def edit
    @auto = Auto.find(params[:id])
---
SELECT "autos".* FROM "autos" WHERE "autos"."id" = ? LIMIT 1  [["id", "11"]]

  def create
    @auto = Auto.new(params[:auto])

    respond_to do |format|
      if @auto.save
---
INSERT INTO "autos" ("agent_id", "created_at", "data_da_infracao", "data_do_cadastro", "fim", "inicio", "updated_at", "validade") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def report
    @autos = Auto.find(:all, :conditions => ['data_do_cadastro = ?', params[:search] ], :order => "inicio")
---
SELECT "autos".* FROM "autos" WHERE (data_do_cadastro LIKE '%2012-01-04%') ORDER BY agent_id